
INSERT INTO Directions (direction_name) VALUES
('Программирование'),
('Веб-дизайн'),
('Аналитика данных'),
('Сетевые технологии'),
('Мобильная разработка');


INSERT INTO Groups (group_name, direction_id) VALUES
('DEV-201', 1), -- Программирование
('DEV-202', 1), -- Программирование
('DESIGN-101', 2), -- Веб-дизайн
('ANALYTICS-301', 3), -- Аналитика данных
('NET-401', 4), -- Сетевые технологии
('MOBILE-101', 5), -- Мобильная разработка
('DEV-203', 1);


INSERT INTO Teachers (first_name, last_name, email) VALUES
('Иван', 'Петров', 'i.petrov@academy.com'),
('Мария', 'Сидорова', 'm.sidorova@academy.com'),
('Алексей', 'Кузнецов', 'a.kuznetsov@academy.com'),
('Елена', 'Морозова', 'e.morozova@academy.com'),
('Дмитрий', 'Смирнов', 'd.smirnov@academy.com');


INSERT INTO Students (first_name, last_name, group_id) VALUES
('Анна', 'Волкова', 1),
('Борис', 'Зайцев', 1),
('Виктор', 'Лебедев', 1),
('Галина', 'Орлова', 2),
('Денис', 'Соколов', 2),
('Екатерина', 'Тихонова', 3),
('Федор', 'Уткин', 3),
('Зоя', 'Шилова', 4),
('Игорь', 'Яковлев', 4),
('Кирилл', 'Абрамов', 5),
('Лариса', 'Белова', 6),
('Михаил', 'Громов', 6),
('Наталья', 'Давыдова', 1),
('Олег', 'Егоров', 2),
('Полина', 'Жукова', 3)

